<?php
// Define an array of quotes
$quotes = [
    "“যে মানব সন্তান ক্ষুদ্র কামনা জয় করতে পারে সে বৃহৎ কামনাও জয় করতে পারে।”</br></br>
    ― Humayun Ahmed, দরজার ওপাশে",
    "“ভীতি কখনোই প্রীতির মতো স্থায়ী ফলদায়ক ঔষধ নয়, তবে তাতে সাময়িক উপশম অবশ্যই হয়।”</br></br>
    ― Abu Taher Misbah, বাইতুল্লাহর মুসাফির",
    "“আমি কখনো অতিরিক্ত কিছুদিন বাঁচার জন্য সিগারেটের আনন্দ ছাড়ার জন্য প্রস্তুত ছিলাম না। আমি ভেবে রেখেছিলাম ডাক্তারকে বলব, আমি একজন লেখক। নিকোটিনের বিষে আমার শরীরের প্রতিটি কোষ অভ্যস্ত। তোমরা আমার চিকিৎসা করো, কিন্তু আমি সিগারেট ছাড়ব না। তাহলে কেন ছাড়লাম? পুত্র নিনিত হামাগুড়ি থেকে হাঁটা শিখেছে। বিষয়টা পুরোপুরি রপ্ত করতে পারেনি। দু-এক পা হেঁটেই ধুম করে পড়ে যায়। ব্যথা পেয়ে কাঁদে। একদিন বসে আছি। টিভিতে খবর দেখছি। হঠাৎ চোখ গেল নিনিতের দিকে। সে হামাগুড়ি পজিশন থেকে উঠে দাঁড়িয়েছে। হেঁটে হেঁটে এগিয়ে আসছে আমার দিকে। তার ছোট্ট শরীর টলমল করছে। যেকোনো সময় পড়ে যাবে এমন অবস্থা। আমি ডান হাত তার দিকে বাড়িয়ে দিতেই সে হাঁটা বাদ দিয়ে দৌড়ে হাতের ওপর ঝাঁপিয়ে পড়ে বিশ্বজয়ের ভঙ্গিতে হাসল। তখনই মনে হলো, এই ছেলেটির সঙ্গে আরও কিছুদিন আমার থাকা উচিত। সিগারেট ছাড়ার সিদ্ধান্ত সেই মুহূর্তেই নিয়ে নিলাম।”</br></br>
    ― Humayun Ahmed",
    "“বলো আমি কতোখানি প্রেম হবো, কতোখানি বিনিদ্র রাত
    সাপের দাঁতের মতো কতোটুকু বিষাক্ত হবো স্বভাবে শরীরে,
    বলো, বলো আমি কতোখানি হিংস্র পাশবিক হবো, কতোখানি
    নিঃসঙ্গ ঈশ্বর!”</br></br>
    ― Rudra Mohammad Shahidullah, উপদ্রুত উপকূল",
    "“কেউ কারো মতো হয় না। আমরা নিজের মতো
    কাউকে অনবরত খুঁজি বলেই
    অপ্রমেয় দুঃখের সমুদ্র
    চতুর্দিকে ফোঁপায়
    আর আমরা সারাদিন সারারাত নারকোল পাতায়
    কান্নার বাতাস বাজিয়ে দ্বীপের মতো জেগে থাকি।”</br></br>
    ― Syed Shamsul Haque, শ্রেষ্ঠ কবিতা",
];

$randomIndex = array_rand($quotes);
$randomQuote = $quotes[$randomIndex];
?>

<!DOCTYPE html>
<head>
    <title>Random Quote</title>
</head>
<body>
    <h1>Bangla Quote:</h1>
    <p><?php echo $randomQuote; ?></p>
</body>
</html>